zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_ENET.h
#define ENET_MAC_RX_TX_STATUS_RWT_MASK           (0x100U)
#define ENET_MAC_RX_TX_STATUS_RWT_SHIFT          (8U)
/*! RWT - Receive Watchdog Timeout
 *  0b0..No receive watchdog timeout
 *  0b1..Receive watchdog timed out
 */
#define ENET_MAC_RX_TX_STATUS_RWT(x)             (((uint32_t)(((uint32_t)(x)) << ENET_MAC_RX_TX_STATUS_RWT_SHIFT)) & ENET_MAC_RX_TX_STATUS_RWT_MASK)
/*! @} */

/*! @name MAC_PMT_CONTROL_STATUS - PMT Control and Status */
/*! @{ */

#define ENET_MAC_PMT_CONTROL_STATUS_PWRDWN_MASK  (0x1U)
#define ENET_MAC_PMT_CONTROL_STATUS_PWRDWN_SHIFT (0U)
/*! PWRDWN - Power Down
 *  0b0..Power down is disabled
 *  0b1..Power down is enabled
 */
#define ENET_MAC_PMT_CONTROL_STATUS_PWRDWN(x)    (((uint32_t)(((uint32_t)(x)) << ENET_MAC_PMT_CONTROL_STATUS_PWRDWN_SHIFT)) & ENET_MAC_PMT_CONTROL_STATUS_PWRDWN_MASK)

#define ENET_MAC_PMT_CONTROL_STATUS_MGKPKTEN_MASK (0x2U)
#define ENET_MAC_PMT_CONTROL_STATUS_MGKPKTEN_SHIFT (1U)
/*! MGKPKTEN - Magic Packet Enable
 *  0b0..Magic Packet is disabled
 *  0b1..Magic Packet is enabled
 */
#define ENET_MAC_PMT_CONTROL_STATUS_MGKPKTEN(x)  (((uint32_t)(((uint32_t)(x)) << ENET_MAC_PMT_CONTROL_STATUS_MGKPKTEN_SHIFT)) & ENET_MAC_PMT_CONTROL_STATUS_MGKPKTEN_MASK)

#define ENET_MAC_PMT_CONTROL_STATUS_MGKPRCVD_MASK (0x20U)
#define ENET_MAC_PMT_CONTROL_STATUS_MGKPRCVD_SHIFT (5U)
/*! MGKPRCVD - Magic Packet Received
 *  0b0..No Magic packet is received
 *  0b1..Magic packet is received
 */
#define ENET_MAC_PMT_CONTROL_STATUS_MGKPRCVD(x)  (((uint32_t)(((uint32_t)(x)) << ENET_MAC_PMT_CONTROL_STATUS_MGKPRCVD_SHIFT)) & ENET_MAC_PMT_CONTROL_STATUS_MGKPRCVD_MASK)
/*! @} */

/*! @name MAC_VERSION - Version */
/*! @{ */

#define ENET_MAC_VERSION_SNPSVER_MASK            (0xFFU)
#define ENET_MAC_VERSION_SNPSVER_SHIFT           (0U)
/*! SNPSVER - Synopsys-defined Version */
#define ENET_MAC_VERSION_SNPSVER(x)              (((uint32_t)(((uint32_t)(x)) << ENET_MAC_VERSION_SNPSVER_SHIFT)) & ENET_MAC_VERSION_SNPSVER_MASK)

#define ENET_MAC_VERSION_USERVER_MASK            (0xFF00U)
#define ENET_MAC_VERSION_USERVER_SHIFT           (8U)
/*! USERVER - User-defined Version (configured with coreConsultant) */
#define ENET_MAC_VERSION_USERVER(x)              (((uint32_t)(((uint32_t)(x)) << ENET_MAC_VERSION_USERVER_SHIFT)) & ENET_MAC_VERSION_USERVER_MASK)
/*! @} */

/*! @name MAC_DEBUG - Debug */
/*! @{ */

#define ENET_MAC_DEBUG_RPESTS_MASK               (0x1U)
#define ENET_MAC_DEBUG_RPESTS_SHIFT              (0U)
/*! RPESTS - MAC GMII or MII Receive Protocol Engine Status
 *  0b0..MAC GMII or MII Receive Protocol Engine Status not detected
 *  0b1..MAC GMII or MII Receive Protocol Engine Status detected
 */
#define ENET_MAC_DEBUG_RPESTS(x)                 (((uint32_t)(((uint32_t)(x)) << ENET_MAC_DEBUG_RPESTS_SHIFT)) & ENET_MAC_DEBUG_RPESTS_MASK)

#define ENET_MAC_DEBUG_RFCFCSTS_MASK             (0x6U)
#define ENET_MAC_DEBUG_RFCFCSTS_SHIFT            (1U)
/*! RFCFCSTS - MAC Receive Packet Controller FIFO Status */
#define ENET_MAC_DEBUG_RFCFCSTS(x)               (((uint32_t)(((uint32_t)(x)) << ENET_MAC_DEBUG_RFCFCSTS_SHIFT)) & ENET_MAC_DEBUG_RFCFCSTS_MASK)

#define ENET_MAC_DEBUG_TPESTS_MASK               (0x10000U)
#define ENET_MAC_DEBUG_TPESTS_SHIFT              (16U)
/*! TPESTS - MAC GMII or MII Transmit Protocol Engine Status
 *  0b0..MAC GMII or MII Transmit Protocol Engine Status not detected
 *  0b1..MAC GMII or MII Transmit Protocol Engine Status detected
 */
#define ENET_MAC_DEBUG_TPESTS(x)                 (((uint32_t)(((uint32_t)(x)) << ENET_MAC_DEBUG_TPESTS_SHIFT)) & ENET_MAC_DEBUG_TPESTS_MASK)

#define ENET_MAC_DEBUG_TFCSTS_MASK               (0x60000U)
#define ENET_MAC_DEBUG_TFCSTS_SHIFT              (17U)
/*! TFCSTS - MAC Transmit Packet Controller Status
 *  0b00..Idle state
 *  0b01..Waiting for one of the following: Status of the previous packet OR IPG or back off period to be over
 *  0b10..Generating and transmitting a Pause control packet (in full-duplex mode)
 *  0b11..Transferring input packet for transmission
 */
#define ENET_MAC_DEBUG_TFCSTS(x)                 (((uint32_t)(((uint32_t)(x)) << ENET_MAC_DEBUG_TFCSTS_SHIFT)) & ENET_MAC_DEBUG_TFCSTS_MASK)
/*! @} */

/*! @name MAC_HW_FEAT - HW Features 0..HW Features 4 */
/*! @{ */

#define ENET_MAC_HW_FEAT_MIISEL_MASK             (0x1U)
#define ENET_MAC_HW_FEAT_MIISEL_SHIFT            (0U)
/*! MIISEL - 10 or 100 Mbps Support
 *  0b0..No 10 or 100 Mbps support
 *  0b1..10 or 100 Mbps support
 */
#define ENET_MAC_HW_FEAT_MIISEL(x)               (((uint32_t)(((uint32_t)(x)) << ENET_MAC_HW_FEAT_MIISEL_SHIFT)) & ENET_MAC_HW_FEAT_MIISEL_MASK)

#define ENET_MAC_HW_FEAT_NRVF_MASK               (0x7U)
#define ENET_MAC_HW_FEAT_NRVF_SHIFT              (0U)
/*! NRVF - Number of Extended VLAN Tag Filters Enabled
 *  0b000..No Extended Rx VLAN Filters
 *  0b001..Reserved
 *  0b010..Reserved
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 */
#define ENET_MAC_HW_FEAT_NRVF(x)                 (((uint32_t)(((uint32_t)(x)) << ENET_MAC_HW_FEAT_NRVF_SHIFT)) & ENET_MAC_HW_FEAT_NRVF_MASK)

#define ENET_MAC_HW_FEAT_PCSEL_MASK              (0x3U)
#define ENET_MAC_HW_FEAT_PCSEL_SHIFT             (0U)
/*! PCSEL - Policing Counters Selected
 *  0b00..Policing counter feature is not selected
 *  0b01..16 Policing counters are selected
 *  0b10..32 Policing counters are selected
 *  0b11..Reserved
 */
#define ENET_MAC_HW_FEAT_PCSEL(x)                (((uint32_t)(((uint32_t)(x)) << ENET_MAC_HW_FEAT_PCSEL_SHIFT)) & ENET_MAC_HW_FEAT_PCSEL_MASK)

#define ENET_MAC_HW_FEAT_RXFIFOSIZE_MASK         (0x1FU)
#define ENET_MAC_HW_FEAT_RXFIFOSIZE_SHIFT        (0U)
/*! RXFIFOSIZE - MTL Receive FIFO Size
 *  0b00000..128 bytes
 *  0b00001..256 bytes
 *  0b00010..512 bytes
 *  0b00011..1024 bytes
 *  0b00100..2048 bytes
 *  0b00101..4096 bytes
 *  0b00110..8192 bytes
 *  0b00111..16384 bytes
 *  0b01000..32 KB
 *  0b01001..64 KB
 *  0b01010..128 KB
 *  0b01011..256 KB
 *  0b01100..Reserved
 */
#define ENET_MAC_HW_FEAT_RXFIFOSIZE(x)           (((uint32_t)(((uint32_t)(x)) << ENET_MAC_HW_FEAT_RXFIFOSIZE_SHIFT)) & ENET_MAC_HW_FEAT_RXFIFOSIZE_MASK)

#define ENET_MAC_HW_FEAT_RXQCNT_MASK             (0xFU)
#define ENET_MAC_HW_FEAT_RXQCNT_SHIFT            (0U)
/*! RXQCNT - Number of MTL Receive Queues
 *  0b0000..1 MTL Rx Queue
 *  0b0001..Reserved
 *  0b0010..Reserved
 *  0b0011..Reserved
 *  0b0100..Reserved
 *  0b0101..Reserved
 *  0b0110..Reserved
 *  0b0111..Reserved
 */
#define ENET_MAC_HW_FEAT_RXQCNT(x)               (((uint32_t)(((uint32_t)(x)) << ENET_MAC_HW_FEAT_RXQCNT_SHIFT)) & ENET_MAC_HW_FEAT_RXQCNT_MASK)

#define ENET_MAC_HW_FEAT_GMIISEL_MASK            (0x2U)
#define ENET_MAC_HW_FEAT_GMIISEL_SHIFT           (1U)
/*! GMIISEL - 1000 Mbps Support
 *  0b0..No 1000 Mbps support
 *  0b1..1000 Mbps support
 */
#define ENET_MAC_HW_FEAT_GMIISEL(x)              (((uint32_t)(((uint32_t)(x)) << ENET_MAC_HW_FEAT_GMIISEL_SHIFT)) & ENET_MAC_HW_FEAT_GMIISEL_MASK)

#define ENET_MAC_HW_FEAT_HDSEL_MASK              (0x4U)
#define ENET_MAC_HW_FEAT_HDSEL_SHIFT             (2U)
/*! HDSEL - Half-duplex Support
 *  0b0..No Half-duplex support
 *  0b1..Half-duplex support
 */
#define ENET_MAC_HW_FEAT_HDSEL(x)                (((uint32_t)(((uint32_t)(x)) << ENET_MAC_HW_FEAT_HDSEL_SHIFT)) & ENET_MAC_HW_FEAT_HDSEL_MASK)

