zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_ENET.h
#define ENET_MAC_HW_FEAT_POUOST_MASK             (0x800000U)
#define ENET_MAC_HW_FEAT_POUOST_SHIFT            (23U)
/*! POUOST - One Step for PTP over UDP/IP Feature Enable
 *  0b0..One Step for PTP over UDP/IP Feature is not selected
 *  0b1..One Step for PTP over UDP/IP Feature is selected
 */
#define ENET_MAC_HW_FEAT_POUOST(x)               (((uint32_t)(((uint32_t)(x)) << ENET_MAC_HW_FEAT_POUOST_SHIFT)) & ENET_MAC_HW_FEAT_POUOST_MASK)

#define ENET_MAC_HW_FEAT_HASHTBLSZ_MASK          (0x3000000U)
#define ENET_MAC_HW_FEAT_HASHTBLSZ_SHIFT         (24U)
/*! HASHTBLSZ - Hash Table Size
 *  0b00..No hash table
 *  0b01..64
 *  0b10..128
 *  0b11..256
 */
#define ENET_MAC_HW_FEAT_HASHTBLSZ(x)            (((uint32_t)(((uint32_t)(x)) << ENET_MAC_HW_FEAT_HASHTBLSZ_SHIFT)) & ENET_MAC_HW_FEAT_HASHTBLSZ_MASK)

#define ENET_MAC_HW_FEAT_MACADR64SEL_MASK        (0x1000000U)
#define ENET_MAC_HW_FEAT_MACADR64SEL_SHIFT       (24U)
/*! MACADR64SEL - MAC Addresses 64-127 Selected
 *  0b0..MAC Addresses 64-127 Select option is not selected
 *  0b1..MAC Addresses 64-127 Select option is selected
 */
#define ENET_MAC_HW_FEAT_MACADR64SEL(x)          (((uint32_t)(((uint32_t)(x)) << ENET_MAC_HW_FEAT_MACADR64SEL_SHIFT)) & ENET_MAC_HW_FEAT_MACADR64SEL_MASK)

#define ENET_MAC_HW_FEAT_PPSOUTNUM_MASK          (0x7000000U)
#define ENET_MAC_HW_FEAT_PPSOUTNUM_SHIFT         (24U)
/*! PPSOUTNUM - Number of PPS Outputs
 *  0b000..No PPS output
 *  0b001..Reserved
 *  0b010..Reserved
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 */
#define ENET_MAC_HW_FEAT_PPSOUTNUM(x)            (((uint32_t)(((uint32_t)(x)) << ENET_MAC_HW_FEAT_PPSOUTNUM_SHIFT)) & ENET_MAC_HW_FEAT_PPSOUTNUM_MASK)

#define ENET_MAC_HW_FEAT_TSSTSSEL_MASK           (0x6000000U)
#define ENET_MAC_HW_FEAT_TSSTSSEL_SHIFT          (25U)
/*! TSSTSSEL - Timestamp System Time Source
 *  0b00..Reserved
 *  0b01..Internal
 *  0b10..External
 *  0b11..Both
 */
#define ENET_MAC_HW_FEAT_TSSTSSEL(x)             (((uint32_t)(((uint32_t)(x)) << ENET_MAC_HW_FEAT_TSSTSSEL_SHIFT)) & ENET_MAC_HW_FEAT_TSSTSSEL_MASK)

#define ENET_MAC_HW_FEAT_FPESEL_MASK             (0x4000000U)
#define ENET_MAC_HW_FEAT_FPESEL_SHIFT            (26U)
/*! FPESEL - Frame Preemption Enable
 *  0b0..Frame Preemption Enable feature is not selected
 *  0b1..Frame Preemption Enable feature is selected
 */
#define ENET_MAC_HW_FEAT_FPESEL(x)               (((uint32_t)(((uint32_t)(x)) << ENET_MAC_HW_FEAT_FPESEL_SHIFT)) & ENET_MAC_HW_FEAT_FPESEL_MASK)

#define ENET_MAC_HW_FEAT_L3L4FNUM_MASK           (0x78000000U)
#define ENET_MAC_HW_FEAT_L3L4FNUM_SHIFT          (27U)
/*! L3L4FNUM - Total number of L3 or L4 Filters
 *  0b0000..No L3 or L4 Filter
 *  0b0001..1 L3 or L4 Filter
 *  0b0010..2 L3 or L4 Filters
 *  0b0011..3 L3 or L4 Filters
 *  0b0100..4 L3 or L4 Filters
 *  0b0101..5 L3 or L4 Filters
 *  0b0110..6 L3 or L4 Filters
 *  0b0111..7 L3 or L4 Filters
 *  0b1000..8 L3 or L4 Filters
 */
#define ENET_MAC_HW_FEAT_L3L4FNUM(x)             (((uint32_t)(((uint32_t)(x)) << ENET_MAC_HW_FEAT_L3L4FNUM_SHIFT)) & ENET_MAC_HW_FEAT_L3L4FNUM_MASK)

#define ENET_MAC_HW_FEAT_SAVLANINS_MASK          (0x8000000U)
#define ENET_MAC_HW_FEAT_SAVLANINS_SHIFT         (27U)
/*! SAVLANINS - Source Address or VLAN Insertion Enable
 *  0b0..Source Address or VLAN Insertion Enable option is not selected
 *  0b1..Source Address or VLAN Insertion Enable option is selected
 */
#define ENET_MAC_HW_FEAT_SAVLANINS(x)            (((uint32_t)(((uint32_t)(x)) << ENET_MAC_HW_FEAT_SAVLANINS_SHIFT)) & ENET_MAC_HW_FEAT_SAVLANINS_MASK)

#define ENET_MAC_HW_FEAT_TBSSEL_MASK             (0x8000000U)
#define ENET_MAC_HW_FEAT_TBSSEL_SHIFT            (27U)
/*! TBSSEL - Time Based Scheduling Enable
 *  0b0..Time Based Scheduling Enable feature is not selected
 *  0b1..Time Based Scheduling Enable feature is selected
 */
#define ENET_MAC_HW_FEAT_TBSSEL(x)               (((uint32_t)(((uint32_t)(x)) << ENET_MAC_HW_FEAT_TBSSEL_SHIFT)) & ENET_MAC_HW_FEAT_TBSSEL_MASK)

#define ENET_MAC_HW_FEAT_ACTPHYSEL_MASK          (0xF0000000U)
#define ENET_MAC_HW_FEAT_ACTPHYSEL_SHIFT         (28U)
/*! ACTPHYSEL - Active PHY Selected
 *  0b0000..GMII or MII
 *  0b0001..Reserved
 *  0b0010..Reserved
 *  0b0011..Reserved
 *  0b0100..Reserved
 *  0b0101..Reserved
 *  0b0110..Reserved
 *  0b0111..Reserved
 *  0b1000..B10T1S
 */
#define ENET_MAC_HW_FEAT_ACTPHYSEL(x)            (((uint32_t)(((uint32_t)(x)) << ENET_MAC_HW_FEAT_ACTPHYSEL_SHIFT)) & ENET_MAC_HW_FEAT_ACTPHYSEL_MASK)

#define ENET_MAC_HW_FEAT_ASP_MASK                (0x30000000U)
#define ENET_MAC_HW_FEAT_ASP_SHIFT               (28U)
/*! ASP - Automotive Safety Package
 *  0b00..No Safety features selected
 *  0b01..Reserved
 *  0b10..Reserved
 *  0b11..Reserved
 */
#define ENET_MAC_HW_FEAT_ASP(x)                  (((uint32_t)(((uint32_t)(x)) << ENET_MAC_HW_FEAT_ASP_SHIFT)) & ENET_MAC_HW_FEAT_ASP_MASK)

#define ENET_MAC_HW_FEAT_AUXSNAPNUM_MASK         (0x70000000U)
#define ENET_MAC_HW_FEAT_AUXSNAPNUM_SHIFT        (28U)
/*! AUXSNAPNUM - Number of Auxiliary Snapshot Inputs
 *  0b000..No auxiliary input
 *  0b001..Reserved
 *  0b010..2 auxiliary input
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 */
#define ENET_MAC_HW_FEAT_AUXSNAPNUM(x)           (((uint32_t)(((uint32_t)(x)) << ENET_MAC_HW_FEAT_AUXSNAPNUM_SHIFT)) & ENET_MAC_HW_FEAT_AUXSNAPNUM_MASK)
/*! @} */

/*! @name MAC_MDIO_ADDRESS - MDIO Address */
/*! @{ */

#define ENET_MAC_MDIO_ADDRESS_GB_MASK            (0x1U)
#define ENET_MAC_MDIO_ADDRESS_GB_SHIFT           (0U)
/*! GB - GMII Busy
 *  0b0..GMII Busy is disabled
 *  0b1..GMII Busy is enabled
 */
#define ENET_MAC_MDIO_ADDRESS_GB(x)              (((uint32_t)(((uint32_t)(x)) << ENET_MAC_MDIO_ADDRESS_GB_SHIFT)) & ENET_MAC_MDIO_ADDRESS_GB_MASK)

#define ENET_MAC_MDIO_ADDRESS_C45E_MASK          (0x2U)
#define ENET_MAC_MDIO_ADDRESS_C45E_SHIFT         (1U)
/*! C45E - Clause 45 PHY Enable
 *  0b0..Clause 45 PHY is disabled
 *  0b1..Clause 45 PHY is enabled
 */
#define ENET_MAC_MDIO_ADDRESS_C45E(x)            (((uint32_t)(((uint32_t)(x)) << ENET_MAC_MDIO_ADDRESS_C45E_SHIFT)) & ENET_MAC_MDIO_ADDRESS_C45E_MASK)

#define ENET_MAC_MDIO_ADDRESS_GOC_0_MASK         (0x4U)
#define ENET_MAC_MDIO_ADDRESS_GOC_0_SHIFT        (2U)
/*! GOC_0 - GMII Operation Command 0
 *  0b0..GMII Operation Command 0 is disabled
 *  0b1..GMII Operation Command 0 is enabled
 */
#define ENET_MAC_MDIO_ADDRESS_GOC_0(x)           (((uint32_t)(((uint32_t)(x)) << ENET_MAC_MDIO_ADDRESS_GOC_0_SHIFT)) & ENET_MAC_MDIO_ADDRESS_GOC_0_MASK)

