zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_ENET.h
/*! @name MAC_SYSTEM_TIME_SECONDS_UPDATE - System Time Seconds Update */
/*! @{ */

#define ENET_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS_MASK (0xFFFFFFFFU)
#define ENET_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS_SHIFT (0U)
/*! TSS - Timestamp Seconds */
#define ENET_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS(x) (((uint32_t)(((uint32_t)(x)) << ENET_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS_SHIFT)) & ENET_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS_MASK)
/*! @} */

/*! @name MAC_SYSTEM_TIME_NANOSECONDS_UPDATE - MAC System Time Nanoseconds Update */
/*! @{ */

#define ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_MASK (0x7FFFFFFFU)
#define ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_SHIFT (0U)
/*! TSSS - Timestamp Sub Seconds
 *  0b0000000000000000000000000000000..Power down is disabled
 *  0b0000000000000000000000000000001..Power down is enabled
 */
#define ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS(x) (((uint32_t)(((uint32_t)(x)) << ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_SHIFT)) & ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_MASK)

#define ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_MASK (0x80000000U)
#define ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_SHIFT (31U)
/*! ADDSUB - Add or Subtract Time
 *  0b0..Add time
 *  0b1..Subtract time
 */
#define ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB(x) (((uint32_t)(((uint32_t)(x)) << ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_SHIFT)) & ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_MASK)
/*! @} */

/*! @name MAC_TIMESTAMP_ADDEND - Timestamp Addend */
/*! @{ */

#define ENET_MAC_TIMESTAMP_ADDEND_TSAR_MASK      (0xFFFFFFFFU)
#define ENET_MAC_TIMESTAMP_ADDEND_TSAR_SHIFT     (0U)
/*! TSAR - Timestamp Addend Register */
#define ENET_MAC_TIMESTAMP_ADDEND_TSAR(x)        (((uint32_t)(((uint32_t)(x)) << ENET_MAC_TIMESTAMP_ADDEND_TSAR_SHIFT)) & ENET_MAC_TIMESTAMP_ADDEND_TSAR_MASK)
/*! @} */

/*! @name MAC_TIMESTAMP_STATUS - Timestamp Status */
/*! @{ */

#define ENET_MAC_TIMESTAMP_STATUS_TSSOVF_MASK    (0x1U)
#define ENET_MAC_TIMESTAMP_STATUS_TSSOVF_SHIFT   (0U)
/*! TSSOVF - Timestamp Seconds Overflow
 *  0b0..Timestamp Seconds Overflow status not detected
 *  0b1..Timestamp Seconds Overflow status detected
 */
#define ENET_MAC_TIMESTAMP_STATUS_TSSOVF(x)      (((uint32_t)(((uint32_t)(x)) << ENET_MAC_TIMESTAMP_STATUS_TSSOVF_SHIFT)) & ENET_MAC_TIMESTAMP_STATUS_TSSOVF_MASK)

#define ENET_MAC_TIMESTAMP_STATUS_TSTARGT0_MASK  (0x2U)
#define ENET_MAC_TIMESTAMP_STATUS_TSTARGT0_SHIFT (1U)
/*! TSTARGT0 - Timestamp Target Time Reached
 *  0b0..Timestamp Target Time Reached status not detected
 *  0b1..Timestamp Target Time Reached status detected
 */
#define ENET_MAC_TIMESTAMP_STATUS_TSTARGT0(x)    (((uint32_t)(((uint32_t)(x)) << ENET_MAC_TIMESTAMP_STATUS_TSTARGT0_SHIFT)) & ENET_MAC_TIMESTAMP_STATUS_TSTARGT0_MASK)

#define ENET_MAC_TIMESTAMP_STATUS_AUXTSTRIG_MASK (0x4U)
#define ENET_MAC_TIMESTAMP_STATUS_AUXTSTRIG_SHIFT (2U)
/*! AUXTSTRIG - Auxiliary Timestamp Trigger Snapshot
 *  0b0..Auxiliary Timestamp Trigger Snapshot status not detected
 *  0b1..Auxiliary Timestamp Trigger Snapshot status detected
 */
#define ENET_MAC_TIMESTAMP_STATUS_AUXTSTRIG(x)   (((uint32_t)(((uint32_t)(x)) << ENET_MAC_TIMESTAMP_STATUS_AUXTSTRIG_SHIFT)) & ENET_MAC_TIMESTAMP_STATUS_AUXTSTRIG_MASK)

#define ENET_MAC_TIMESTAMP_STATUS_TSTRGTERR0_MASK (0x8U)
#define ENET_MAC_TIMESTAMP_STATUS_TSTRGTERR0_SHIFT (3U)
/*! TSTRGTERR0 - Timestamp Target Time Error
 *  0b0..Timestamp Target Time Error status not detected
 *  0b1..Timestamp Target Time Error status detected
 */
#define ENET_MAC_TIMESTAMP_STATUS_TSTRGTERR0(x)  (((uint32_t)(((uint32_t)(x)) << ENET_MAC_TIMESTAMP_STATUS_TSTRGTERR0_SHIFT)) & ENET_MAC_TIMESTAMP_STATUS_TSTRGTERR0_MASK)

#define ENET_MAC_TIMESTAMP_STATUS_TXTSSIS_MASK   (0x8000U)
#define ENET_MAC_TIMESTAMP_STATUS_TXTSSIS_SHIFT  (15U)
/*! TXTSSIS - Tx Timestamp Status Interrupt Status
 *  0b0..Tx Timestamp Status Interrupt status not detected
 *  0b1..Tx Timestamp Status Interrupt status detected
 */
#define ENET_MAC_TIMESTAMP_STATUS_TXTSSIS(x)     (((uint32_t)(((uint32_t)(x)) << ENET_MAC_TIMESTAMP_STATUS_TXTSSIS_SHIFT)) & ENET_MAC_TIMESTAMP_STATUS_TXTSSIS_MASK)

#define ENET_MAC_TIMESTAMP_STATUS_ATSSTN_MASK    (0xF0000U)
#define ENET_MAC_TIMESTAMP_STATUS_ATSSTN_SHIFT   (16U)
/*! ATSSTN - Auxiliary Timestamp Snapshot Trigger Identifier */
#define ENET_MAC_TIMESTAMP_STATUS_ATSSTN(x)      (((uint32_t)(((uint32_t)(x)) << ENET_MAC_TIMESTAMP_STATUS_ATSSTN_SHIFT)) & ENET_MAC_TIMESTAMP_STATUS_ATSSTN_MASK)

#define ENET_MAC_TIMESTAMP_STATUS_ATSSTM_MASK    (0x1000000U)
#define ENET_MAC_TIMESTAMP_STATUS_ATSSTM_SHIFT   (24U)
/*! ATSSTM - Auxiliary Timestamp Snapshot Trigger Missed
 *  0b0..Auxiliary Timestamp Snapshot Trigger Missed status not detected
 *  0b1..Auxiliary Timestamp Snapshot Trigger Missed status detected
 */
#define ENET_MAC_TIMESTAMP_STATUS_ATSSTM(x)      (((uint32_t)(((uint32_t)(x)) << ENET_MAC_TIMESTAMP_STATUS_ATSSTM_SHIFT)) & ENET_MAC_TIMESTAMP_STATUS_ATSSTM_MASK)

#define ENET_MAC_TIMESTAMP_STATUS_ATSNS_MASK     (0x3E000000U)
#define ENET_MAC_TIMESTAMP_STATUS_ATSNS_SHIFT    (25U)
/*! ATSNS - Number of Auxiliary Timestamp Snapshots */
#define ENET_MAC_TIMESTAMP_STATUS_ATSNS(x)       (((uint32_t)(((uint32_t)(x)) << ENET_MAC_TIMESTAMP_STATUS_ATSNS_SHIFT)) & ENET_MAC_TIMESTAMP_STATUS_ATSNS_MASK)
/*! @} */

/*! @name MAC_RX_DOMAIN_TIME_INCR - Receive Domain TIme Increment */
/*! @{ */

#define ENET_MAC_RX_DOMAIN_TIME_INCR_RXNS_MASK   (0xFFFF0000U)
#define ENET_MAC_RX_DOMAIN_TIME_INCR_RXNS_SHIFT  (16U)
/*! RXNS - Receive Domain Time Increment Value in Nanoseconds. */
#define ENET_MAC_RX_DOMAIN_TIME_INCR_RXNS(x)     (((uint32_t)(((uint32_t)(x)) << ENET_MAC_RX_DOMAIN_TIME_INCR_RXNS_SHIFT)) & ENET_MAC_RX_DOMAIN_TIME_INCR_RXNS_MASK)
/*! @} */

/*! @name MAC_TX_DOMAIN_TIME_INCR - Transmit Domain TIme Increment */
/*! @{ */

#define ENET_MAC_TX_DOMAIN_TIME_INCR_TXNS_MASK   (0xFFFF0000U)
#define ENET_MAC_TX_DOMAIN_TIME_INCR_TXNS_SHIFT  (16U)
/*! TXNS - Transmit Domain Time Increment Value in Nanoseconds. */
#define ENET_MAC_TX_DOMAIN_TIME_INCR_TXNS(x)     (((uint32_t)(((uint32_t)(x)) << ENET_MAC_TX_DOMAIN_TIME_INCR_TXNS_SHIFT)) & ENET_MAC_TX_DOMAIN_TIME_INCR_TXNS_MASK)
/*! @} */

/*! @name MAC_TX_TIMESTAMP_STATUS_NANOSECONDS - Transmit Timestamp Status Nanoseconds */
/*! @{ */

